Documents/КорректировкаЦеховыхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>КорректировкаЦеховыхОстатков</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияМатериаловЦех</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оприходовать</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Списать</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КорректировкаЦеховыхОстатков/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПечатьАктКорректировка(ТабДок, Ссылка) Экспорт
	
	ФормСтрока = "Л=ru_RU";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	
	Для Каждого Док Из Ссылка Цикл
	
	Макет = Документы.КорректировкаЦеховыхОстатков.ПолучитьМакет("ПечатьАктКорректировка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Корректировка.Дата,
	|	Корректировка.Номер,
	|	Корректировка.Подразделение,
	|	Корректировка.СуммаДокумента,
	|	Корректировка.СписокНоменклатуры.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Оприходовать,
	|		Списать,
	|		Описание
	|	)
	|ИЗ
	|	Документ.КорректировкаЦеховыхОстатков КАК Корректировка
	|ГДЕ
	|	Корректировка.Ссылка В(&Ссылка)
	|	И Корректировка.Проведен";
	
	Запрос.Параметры.Вставить("Ссылка", Док);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблица = Макет.ПолучитьОбласть("ШапкаТаблица");
	ОбластьСтрокаТаблица = Макет.ПолучитьОбласть("СтрокаТаблица");
	Подписи = Макет.ПолучитьОбласть("Подписи");
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	Пока Выборка.Следующий() Цикл
		
		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Подразделение = Док.Подразделение;
		Шапка.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
		Шапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Док.Номер);
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьШапкаТаблица);
		ВыборкаСписокНоменклатуры = Выборка.СписокНоменклатуры.Выбрать();
		Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
			ОбластьСтрокаТаблица.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
			ТабДок.Вывести(ОбластьСтрокаТаблица, ВыборкаСписокНоменклатуры.Уровень());
		КонецЦикла;
		
		Подписи.Параметры.Заполнить(Выборка);
		Подписи.Параметры.Сумма = Строка(Выборка.СуммаДокумента) + "  ( " + ЧислоПрописью(Выборка.СуммаДокумента, ФормСтрока, ПарПредмета)+" )";
		Подписи.Параметры.ФизЛицоДиректор = ФизическиеЛица.ФамилияИнициалыФизЛица(Док.Подразделение.Руководитель);
		Подписи.Параметры.ФизЛицоУправляющий = ФизическиеЛица.ФамилияИнициалыФизЛица(Док.Подразделение.Управляющий);
		ТабДок.Вывести(Подписи);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры
